Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame({'name':['sagar','shubham','shreyash']})
df

       name
0     sagar
1   shubham
2  shreyash

In [3]:
#pd.read_csv("filename_new.csv")

In [4]:
pd.Series([22,21,24])

0    22
1    21
2    24
dtype: int64

In [5]:
pd.date_range('2023-01-25','2023-02-01')

DatetimeIndex(['2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31', '2023-02-01'],
              dtype='datetime64[ns]', freq='D')

In [6]:
pd.Timedelta(' 1 days 30 min')

Timedelta('1 days 00:30:00')

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
df=pd.DataFrame({'A':[1,2,32],'B':[5,5,2],'C':[2,96,5]})
index=[]
a=1
for i in range(1,df['A'].count()+1):
    index.append(a)
    a+=2
df['index']=index  
df.set_index('index')

        A  B   C
index
1       1  5   2
3       2  5  96
5      32  2   5

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [8]:
df1=pd.DataFrame({'A':[1,2,32,2],'B':[5,5,2,2],'Values':[2,96,5,56]})
df1

    A  B  Values
0   1  5       2
1   2  5      96
2  32  2       5
3   2  2      56

In [9]:
def sum_val(x):
    return x.sum()
sum_val(df1["Values"].head(3))

103

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [10]:
df2=pd.DataFrame({'Text':["I live in a beautiful country named India"]})
df2['Word_Count']=df2["Text"].apply(lambda x : len(x.split()))
df2

                                        Text  Word_Count
0  I live in a beautiful country named India           8

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [11]:
print(df1.size) # returns the total no. of entries ie. no. of rows*no. of columns
print(df1.shape) # returns tuple containing no. of rows,columns

12
(4, 3)

Q6. Which function of pandas do we use to read an excel file?

pd.read_excel() is used for reading excel files

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [12]:
df3=pd.DataFrame({"Email":['ver@gmail.com','sagar@gmail.com']})
df3['Username']=df3['Email'].apply(lambda x : x.split('@')[0])
df3

             Email Username
0    ver@gmail.com      ver
1  sagar@gmail.com    sagar

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [13]:
df=pd.DataFrame({'A':[1,2,32],'B':[5,5,2],'C':[2,96,5]})

In [14]:
#Method 1

df[(df['A']>5) & (df['B']<10)]

    A  B  C
2  32  2  5

In [15]:
#Method2
for index,rows in df.iterrows():
    if rows['A']>5 and rows['B']<10:
        pass
    else:
        df.drop(index,axis=0,inplace=True)
        
df

    A  B  C
2  32  2  5

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [16]:
df1

    A  B  Values
0   1  5       2
1   2  5      96
2  32  2       5
3   2  2      56

In [17]:
print(df1.Values.mean())
print(df1.Values.median())
print(df1.Values.std())

39.75
30.5
44.947191235938206

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [18]:
df4=pd.DataFrame({"Sales":[3200,2320,8500,9452,1110,9841,1214,32644,2164,12141,2152,5623,65621,9761,46232,64610]})
df4['date']=pd.Series(pd.date_range('2023-05-01','2023-05-16'))
df4

    Sales       date
0    3200 2023-05-01
1    2320 2023-05-02
2    8500 2023-05-03
3    9452 2023-05-04
4    1110 2023-05-05
5    9841 2023-05-06
6    1214 2023-05-07
7   32644 2023-05-08
8    2164 2023-05-09
9   12141 2023-05-10
10   2152 2023-05-11
11   5623 2023-05-12
12  65621 2023-05-13
13   9761 2023-05-14
14  46232 2023-05-15
15  64610 2023-05-16

In [19]:
df4['MovingAverage']=df4['Sales'].rolling(window=7).mean()
df4

    Sales       date  MovingAverage
0    3200 2023-05-01            NaN
1    2320 2023-05-02            NaN
2    8500 2023-05-03            NaN
3    9452 2023-05-04            NaN
4    1110 2023-05-05            NaN
5    9841 2023-05-06            NaN
6    1214 2023-05-07    5091.000000
7   32644 2023-05-08    9297.285714
8    2164 2023-05-09    9275.000000
9   12141 2023-05-10    9795.142857
10   2152 2023-05-11    8752.285714
11   5623 2023-05-12    9397.000000
12  65621 2023-05-13   17365.571429
13   9761 2023-05-14   18586.571429
14  46232 2023-05-15   20527.714286
15  64610 2023-05-16   29448.571429

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [20]:
df5=pd.DataFrame()
df5['date']=pd.Series(pd.date_range('2023-05-01','2023-05-10'))
df5['Weekday']=df5['date'].dt.day_name()
df5

        date    Weekday
0 2023-05-01     Monday
1 2023-05-02    Tuesday
2 2023-05-03  Wednesday
3 2023-05-04   Thursday
4 2023-05-05     Friday
5 2023-05-06   Saturday
6 2023-05-07     Sunday
7 2023-05-08     Monday
8 2023-05-09    Tuesday
9 2023-05-10  Wednesday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [24]:
df6=pd.DataFrame()
df6['date']=pd.Series(pd.date_range('2023-01-01','2023-02-10'))
df6[ (pd.to_datetime('2023-01-01')< df6['date']) & (df6['date']<pd.to_datetime('2023-01-31')) ]

         date
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30

In [28]:
"""df6=pd.DataFrame()
df6['date']=pd.Series(pd.date_range('2023-01-01','2023-02-10'))
for index,rows in df6.iterrows():
    if (pd.to_datetime('2023-01-01')<rows) & (rows<pd.to_datetime('2023-01-31')):
        pass
    else:
        df6.drop(index,inplace=True)
df6"""

"df6=pd.DataFrame()\ndf6['date']=pd.Series(pd.date_range('2023-01-01','2023-02-10'))\nfor index,rows in df6.iterrows():\n    if (pd.to_datetime('2023-01-01')<rows) & (rows<pd.to_datetime('2023-01-31')):\n        pass\n    else:\n        df6.drop(index,inplace=True)\ndf6"

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [29]:
import pandas